STMicroelectronics/stm32wba-classic-coremw-apps/Projects/NUCLEO-WBA65RI/Applications/USB_Device/HID_Standalone/USB_Device/Target/usbd_conf.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           USB_Device/HID_Standalone/USB_Device/Target/usbd_conf.c
  * @author         MCD Application Team
  * @brief          This file implements the board support package for the USB device library
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "stm32wbaxx.h"
#include "stm32wbaxx_hal.h"
#include "usbd_hid.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

PCD_HandleTypeDef hpcd_USB_OTG_HS;

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/* Exported function prototypes ----------------------------------------------*/

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void SystemClockConfig_Resume(void);

/* USER CODE END PFP */

/* Private functions ---------------------------------------------------------*/
static USBD_StatusTypeDef USBD_Get_USB_Status(HAL_StatusTypeDef hal_status);
/* USER CODE BEGIN 1 */

/* USER CODE END 1 */
extern void SystemClock_Config(void);
extern void Error_Handler(void);
/*******************************************************************************
                       LL Driver Callbacks (PCD -> USB Device Library)
*******************************************************************************/
/* MSP Init */

#if (USE_HAL_PCD_REGISTER_CALLBACK == 1U)
static void HAL_PCD_MspInit(PCD_HandleTypeDef* hpcd)
#else
void HAL_PCD_MspInit(PCD_HandleTypeDef* hpcd)
#endif /* USE_HAL_PCD_REGISTER_CALLBACK */
{
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
  if(hpcd->Instance==USB_OTG_HS)
  {
    /* USER CODE BEGIN USB_OTG_HS_PCD_MspInit 0 */

    /* USER CODE END USB_OTG_HS_PCD_MspInit 0 */

    /** Initializes the peripherals clock
    */
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USBOTGHSPHY;
    PeriphClkInit.UsbOtgHsPhyClockSelection = RCC_USBOTGHSPHYCLKSOURCE_HSE;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
    {
      Error_Handler();
    }

    /** Set the OTG PHY reference clock selection
    */
    HAL_SYSCFG_SetOTGPHYReferenceClockSelection(SYSCFG_OTG_HS_PHY_CLK_SELECT_6);

    if(__HAL_RCC_PWR_IS_CLK_ENABLED())
    {
      HAL_PWREx_EnableVddUSB();
      HAL_PWREx_EnableVdd11USB();
      HAL_PWREx_EnableUSBPWR();
      HAL_PWREx_EnableUSBBooster();
    }
    else
    {
      __HAL_RCC_PWR_CLK_ENABLE();
      HAL_PWREx_EnableVddUSB();
      HAL_PWREx_EnableVdd11USB();
      HAL_PWREx_EnableUSBPWR();
      HAL_PWREx_EnableUSBBooster();
      __HAL_RCC_PWR_CLK_DISABLE();
    }

    HAL_SYSCFG_EnableOTGPHY(SYSCFG_OTG_HS_PHY_ENABLE);
    /* Peripheral clock enable */
    __HAL_RCC_USB_OTG_HS_CLK_ENABLE();
    __HAL_RCC_USB_OTG_HS_PHY_CLK_ENABLE();
    /* USB_OTG_HS interrupt Init */
    HAL_NVIC_SetPriority(USB_OTG_HS_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(USB_OTG_HS_IRQn);
    /* USER CODE BEGIN USB_OTG_HS_PCD_MspInit 1 */

    /* USER CODE END USB_OTG_HS_PCD_MspInit 1 */

  }

}

#if (USE_HAL_PCD_REGISTER_CALLBACK == 1U)
static void HAL_PCD_MspDeInit(PCD_HandleTypeDef* hpcd)
#else
void HAL_PCD_MspDeInit(PCD_HandleTypeDef* hpcd)
#endif /* USE_HAL_PCD_REGISTER_CALLBACK */
{
  if(hpcd->Instance==USB_OTG_HS)
  {
    /* USER CODE BEGIN USB_OTG_HS_PCD_MspDeInit 0 */

    /* USER CODE END USB_OTG_HS_PCD_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_USB_OTG_HS_CLK_DISABLE();
    __HAL_RCC_USB_OTG_HS_PHY_CLK_DISABLE();
    __HAL_RCC_SYSCFG_CLK_DISABLE();

    if(__HAL_RCC_PWR_IS_CLK_ENABLED())
    {
      HAL_PWREx_DisableUSBBooster();
      HAL_PWREx_DisableUSBPWR();
      HAL_PWREx_DisableVdd11USB();
    }
    else
    {
      __HAL_RCC_PWR_CLK_ENABLE();
      HAL_PWREx_DisableUSBBooster();
      HAL_PWREx_DisableUSBPWR();
      HAL_PWREx_DisableVdd11USB();
      __HAL_RCC_PWR_CLK_DISABLE();
    }

    /* USB_OTG_HS interrupt DeInit */
    HAL_NVIC_DisableIRQ(USB_OTG_HS_IRQn);
    /* USER CODE BEGIN USB_OTG_HS_PCD_MspDeInit 1 */

    /* USER CODE END USB_OTG_HS_PCD_MspDeInit 1 */
  }

}

/**
  * @brief  Setup Stage callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
static void PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
#else
void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
{
  /* USER CODE BEGIN HAL_PCD_SetupStageCallback_PreTreatment */

  /* USER CODE END  HAL_PCD_SetupStageCallback_PreTreatment */
  USBD_LL_SetupStage((USBD_HandleTypeDef*)hpcd->pData, (uint8_t *)hpcd->Setup);
  /* USER CODE BEGIN HAL_PCD_SetupStageCallback_PostTreatment */

  /* USER CODE END  HAL_PCD_SetupStageCallback_PostTreatment */
}

/**
  * @brief  Data Out Stage callback.
  * @param  hpcd: PCD handle
  * @param  epnum: Endpoint number
  * @retval None
  */
#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
static void PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
#else
void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
{
  /* USER CODE BEGIN HAL_PCD_DataOutStageCallback_PreTreatment */

